DROP TABLE DEALS_COSTS_KOEFS
GO

CREATE TABLE DEALS_COSTS_KOEFS (
	ID INT IDENTITY,
	SLICE VARCHAR(50), SUBJECT_ID INT, SHORT_NAME VARCHAR(50), ARTICLE_RATIO FLOAT,
	INDEX IX_DEALS_COSTS_KOEFS CLUSTERED (ID),
	PRIMARY KEY (SLICE, SUBJECT_ID, SHORT_NAME)
)

insert into deals_costs_koefs(slice, short_name, subject_id, article_ratio)
values 
	('base', '', 0, 0),
	('base', 'Работа', 15340, 11),
	('base', 'Работа', 461, 1.78),
	('base', 'Работа', 2, 1.44),
	('base', 'Работа', 11625, 12.67),
	('base', 'Материалы', 15340, 34),
	('base', 'Материалы', 461, 15),
	('base', 'Материалы', 2, 3.4),
	('base', 'Материалы', 11625	, 5.8),
	('base', 'Агентское вознаграждение', 15340, 3.3),
	('base', 'Маркетинг', 15340, 0.7),
	('base', 'Операционная прибыль', 15340, 9.51),
	('base', 'Конструкторское сопровождение', 15340, 1.4),

	('201911', '', 0, 0),
	('201911', 'Работа', 15340, 12.1),
	('201911', 'Работа', 461, 1.75),
	('201911', 'Работа', 2, 1.4),
	('201911', 'Работа', 11625, 11.56),
	('201911', 'Материалы', 15340, 34),
	('201911', 'Материалы', 461, 15),
	('201911', 'Материалы', 2, 3.4),
	('201911', 'Материалы', 11625	, 5.7),
	('201911', 'Агентское вознаграждение', 15340, 3.3),
	('201911', 'Маркетинг', 15340, 0.7),
	('201911', 'Операционная прибыль', 15340, 10.74),
	('201911', 'Конструкторское сопровождение', 15340, 0.35)

GO
